huyun12041204/STM32/Catcher/user/main.c
/* 程序下载后D1指示灯闪烁表示程序正常运行，按键K_UP切换频率显示控制和电压控制调节，
	K_DOWN按键减，K_RIGHT按键加，AD输入端口采用PA2，可以使用另外一块普中STM32开发板
	下载里面配套的一个脉冲发生程序进去测试，脉冲通过PC1口发送出来通过导线直接输入到示波器
	开发板上的PA2口即可检测到具体的波形，如果只有一块普中STM32开发板的朋友可以使用信号
	发生器产生信号输入到PA2口。程序只是做了一个简单的采集和显示调节，采集的精度和准确度
	还是比较高的。*/

#include "system.h"
#include "SysTick.h"
#include "usart.h"
//#include "led.h"
//#include "button.h"
#include "tftlcd.h"
#include "gui.h"
#include "tim.h"
#include "stm32f10x_it.h"
#include "sram.h" 
#include "String.h"
#include "malloc.h" 
#include "sd.h"

#include "Command.h"
#include "var.h"
#include "dma.h"



//移植USB时候的头文件
//#include "mass_mal.h"
#include "usb_lib.h"
#include "hw_config.h"
#include "usb_pwr.h"


#include "usbio.h"
extern volatile uint32_t EP1_ReceivedCount;


#if 0


void clear_point(u16 hang)
{
	u8 index_clear_lie = 0;
	FRONT_COLOR = DARKBLUE;
	for (index_clear_lie = 0; index_clear_lie < 201; index_clear_lie++)
	{
		//	lcd_huadian(hang,index_clear_lie,FRONT_COLOR);
	}
	FRONT_COLOR = RED;
}
void ShowCLK2TFT(u16 u16CLK)
{
	u8 clk_buf[6];

	clk_buf[u16Digit2Ascii(u16CLK, clk_buf)] = '\0';

	GUI_Show12ASCII(60, 20, clk_buf, FRONT_COLOR, WHITE);

	GUI_Show12ASCII(100, 20, "kHz", FRONT_COLOR, WHITE);

}

#else

u16 lCurY;
u16 lCurX;

void LCD_Dislay_Init()
{
	//初始化设备
	TFTLCD_Init();
	
//	FRONT_COLOR = YELLOW;
	LCD_Clear(BLACK);
	FRONT_COLOR = RED;
	lCurY = 10;
    lCurX = 10;
}



void LCD_Dislay_Printf(u8 *p)
{

	GUI_Show12ASCII(10, lCurY, p, FRONT_COLOR, BLACK);

	lCurY += 20;

	if (lCurY > 300)
	{
		lCurY = 10;
	}
	
	delay_ms(10);

}
#endif


int fputc(int ch,FILE *p)  //函数默认的，在使用printf函数时自动调用
{
		

 
	
	if(ch == '\n')
	{
		lCurX  = 10;
		lCurY += 20;
		if (lCurY > 300)	
			lCurY = 10;
	}
	else
	{
		 GUI_Show12ASCII(lCurX, lCurY, (uint8_t*)&ch, FRONT_COLOR, BLACK);
			lCurX += 8;
	}
		
	

	
//     	USART_SendData(USART1,(u8)ch);	
//	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)==RESET);

	return ch;
}



u8 u8Digit2Ascii(u8 u8Digit,u8* u8Ascii)
{

	u8 u8temp[3];
	u8 u8TDigit = u8Digit;
	u8 i;

	for ( i = 3; i > 0; i--)
	{
		u8temp[i-1]= u8TDigit % 10 + 0x30;
		u8TDigit = u8TDigit / 10;
	}

	for (i = 0; i < 2; i++)
	{
		if (u8temp[i] != 0x30)
			break;
	}

	memcpy(u8Ascii, u8temp+i, 3 - i);

	return 3 - i;

}

u8 u16Digit2Ascii(u16 u16Digit, u8* u8Ascii)
{

	u8 u8temp[5];
	u16 TDigit = u16Digit;
	u8 i;

	for (i = 5; i > 0; i--)
	{
		u8temp[i - 1] = TDigit % 10 + 0x30;
		TDigit = TDigit / 10;
	}


	for (i = 0; i < 4; i++)
	{
		if (u8temp[i] != 0x30)
			break;
	}

	memcpy(u8Ascii, u8temp + i, 5 - i);

	return 5 - i;

}




//USB使能连接/断线
//enable:0,断开
//       1,允许连接	   
void USB_Port_Set(u8 enable)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);    //使能PORTA时钟		 
	if(enable)_SetCNTR(_GetCNTR()&(~(1<<1)));//退出断电模式
	else
	{	  
		_SetCNTR(_GetCNTR()|(1<<1));  // 断电模式
		GPIOA->CRH&=0XFFF00FFF;
		GPIOA->CRH|=0X00033000;
		PAout(12)=0;	    		  
	}
} 


void  Initialize_Module(void)
{
		//FSMC_SRAM_Init();

	
//	u8 i=0;
//	u32 free,total;
//	u8 i = 0;
//	u32 sd_size;
//	u8 sd_buf[6];

	//初始化时钟
	SysTick_Init(72);

	//定义中断优先级
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);  //中断优先级分组分2组

	//USART1 115200
	//USART1_Init(864000);

	//显示屏
	LCD_Dislay_Init();

	LCD_Dislay_Printf("Initialize LCD finished!");
	

	//初始化计时器
	Tim_Init();		
	LCD_Dislay_Printf("Initialize TIM finished!");

	//IO口使用外部中断 , CLK 外部中断 
	PINx_EXIT_Init();

	LCD_Dislay_Printf("Initialize Exit IO finished!");
	
	


	if (SD_Init())
	{
		LCD_Dislay_Printf("SD Card Error!");
	}
	LCD_Dislay_Printf("SD Card OK!");
	
  FSMC_SRAM_Init();
	
	printf("Initialize Sram!\n"); 

	PINx_Level_Conversion_Init();

	printf("Level conversion finish!\n");
	
	
	delay_ms(100);
	USB_Port_Set(0); 	//USB先断开
	delay_ms(700);
	USB_Port_Set(1);	//USB再次连接
	USB_Interrupts_Config();
	Set_USBClock();
	USB_Init();

	printf("USB Finish...\n");

}

void  Initialize_Global_variable(void)
{

	//当前CLKNumber
 u64CurCLK = 0;
//之前CLKNumber
 u64PreCLK = 0;
	
 u32CLKLen  = 0;
 u32SendLen = 0;

//TIM2 的计数器
 count = 0;
	
	
 Tim5Count = 0;



}



u8 SendData_USB(uint8_t bEpNum,uint8_t *data,uint32_t dataNum)
{

	if(dataNum > 64)
		dataNum = 64;

	return USB_SendData(ENDP1,data,dataNum);
}



u8 SendChannelData_USB()
{
	u32 u32CurCount = u32CLKLen;
	
	u32 u32WillSend;

	u8 u8Ret = 0;
	if (GetEPTxStatus(ENDP1) != EP_TX_NAK)
		return 1;
	
	

	if(u32SendLen > u32CurCount)
	{	
		printf("over limit!");
		u32WillSend = _MaxSram - u32SendLen;
	}
	else
	{
		u32WillSend = u32CurCount - u32SendLen;

	}
	if(u32WillSend > 64)
		u32WillSend = 64;

		FSMC_SRAM_ReadBuf(_USB_SendBuf, u32SendLen ,u32WillSend);		
	
	
	  if(u32SendLen > 0x100)
		{
		if(((_USB_SendBuf[0] == 0xFF)&&(_USB_SendBuf[1] == 0xFF))||
			((_USB_SendBuf[0] == 0x00)&&(_USB_SendBuf[1] == 0x00))||
			((_USB_SendBuf[62] == 0xFF)&&(_USB_SendBuf[63] == 0xFF))||
			((_USB_SendBuf[62] == 0x00)&&(_USB_SendBuf[63] == 0x00)))
	   	printf("Error: %x - %d\n",u32SendLen,u32WillSend);
	//		FSMC_SRAM_ReadBuf(_USB_SendBuf, u32SendLen ,u32WillSend);		
		}
	

	
		u8Ret = SendData_USB(ENDP1,_USB_SendBuf,u32WillSend );
		u32SendLen = u32SendLen+ u8Ret;
	  if(u32SendLen == _MaxSram)
			u32SendLen = 0;
			
	

	return 0;

}



void Test_Sram(void)

{
	u32 ii = 0;
	u8 jj;
	u8 Put[64];
	u8 Inp[64];

	for (ii = 0 ; ii < _MaxSram ; ii+=64)
	{
		memset(Put, 0x33, 64);
		memset(Inp, 0x55, 64);
		FSMC_SRAM_WriteBuf(Put, ii, 64);

		FSMC_SRAM_ReadBuf(Inp, ii,64);
		for(jj = 0 ; jj < 64 ; jj++)
		{
			if(Put[jj]!= Inp[jj])
				printf("Error in : %x \n",ii);
			
		}

    

	}
	
		printf("Test finish!");
}

int main(void)
{
	

	u8 Sended = 0;
	u8 USB_Res[2];

	//初始化各个模块
	Initialize_Module();

	Initialize_Global_variable();
	
	//此处需要先读取当前各个端口状态,VCC RST IO
	_Pre_Pin_Statue = GetPinValue();

	Tim_Enable();			//同步开始计数
	
 // Test_SD();
	printf("Start ...!\n"); 
	
	//Test_Sram();
	while(1)
	{	
		//SendChannelData();
		
		//printf("-4-%d\n",iiii);
		if(EP1_ReceivedCount!=0)
		{
			USB_GetData(ENDP1,USB_Res,2);
			EP1_ReceivedCount = 0;  
			Sended = 0;	
		}
		

		if(u32SendLen != u32CLKLen)
		{

		
			if (GetEPTxStatus(ENDP1) != EP_TX_NAK)
	    {
				continue;
			}
			if(Sended == 0)
			{		
				if(	SendChannelData_USB() == 0)					
				Sended = 1;	
				
			}
			
			

		}


	
	}
}


